БухЭксп/Catalogs/CW_ПрофилиДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПрофилиДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ОбъектыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ТипыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ОбъектыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ТипыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеКроме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоВыбранные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ОбъектыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ОбъектыДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник_Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник_ВерсииБюджетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПрофилиДоступа/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектыДоступаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ОбъектыДоступа.ТекущаяСтрока;
	
	ОбновитьОтборСтрок();	
	ОбработатьВидимостьЗначенийДоступа(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДоступаОбъектДоступаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыДоступа.ТекущиеДанные;
	ТекущиеДанные.ТипДоступа = ПредопределенноеЗначение("Перечисление.CW_ТипыДоступа.Все");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДоступаТипДоступаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОбъектыДоступа.ТекущаяСтрока;
	
	ОбновитьОтборСтрок();
	
	ОбработатьУдалениеСтрок(ТекущаяСтрока);
	ОбработатьВидимостьЗначенийДоступа(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборСтрок()
	
	ТекущиеДанные = Элементы.ОбъектыДоступа.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектДоступа,ТипДоступа",ТекущиеДанные.ОбъектДоступа,ТекущиеДанные.ТипДоступа);
		Элементы.ЗначенияДоступа.ОтборСтрок = ОтборСтрок; 
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУдалениеСтрок(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.ОбъектыДоступа.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Отбор = Новый Структура("ОбъектДоступа", ТекущиеДанные.ОбъектДоступа);
	
	мСтрокиКУдалению = Объект.ЗначенияДоступа.НайтиСтроки(Отбор);
	//Удаляем строки по объекут отбора, так как не может
	//быть несколько одинаковых обектов отбора в таблице объектов доступа.
	
	Для Каждого СтрокаКУдалению из мСтрокиКУдалению Цикл
		
		Объект.ЗначенияДоступа.Удалить(СтрокаКУдалению); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьЗначенийДоступа(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.ОбъектыДоступа.НайтиПоИдентификатору(?(ТекущаяСтрока = Неопределено, -1, ТекущаяСтрока));
	
	ВидимостьЗначенияДоступа = Ложь;
	Если ТекущиеДанные <> Неопределено Тогда
		 ВидимостьЗначенияДоступа  = ?(Не ЗначениеЗаполнено(ТекущиеДанные.ТипДоступа), Ложь, ТекущиеДанные.ТипДоступа <> Перечисления.CW_ТипыДоступа.Все)
	КонецЕсли;
	
	Элементы.ЗначенияДоступа.Видимость  = ВидимостьЗначенияДоступа;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеОбъектыДоступа	 = Элементы.ОбъектыДоступа.ТекущиеДанные;
	ТекущиеДанныеЗначенияДоступа = Элементы.ЗначенияДоступа.ТекущиеДанные;
	
	ТекущиеДанныеЗначенияДоступа.ОбъектДоступа 	=  ТекущиеДанныеОбъектыДоступа.ОбъектДоступа;
	ТекущиеДанныеЗначенияДоступа.ТипДоступа 	=  ТекущиеДанныеОбъектыДоступа.ТипДоступа;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	времТаблица = ТекущийОбъект.ЗначенияДоступа.Выгрузить();
	времТаблица.Свернуть("ОбъектДоступа,ТипДоступа,ЗначениеДоступа",);
	
	Если времТаблица.Количество() <>   ТекущийОбъект.ЗначенияДоступа.Количество() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Дублирование строк в таблице значений доступа";
		Сообщение.Сообщить();
		
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьДублиСтрокОбъектовДоступа(Отказ);
	
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Дублирование объектов доступа!");
	Иначе
		ПроверитьИЗаписатьПрофилиДоступаПользователей();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры  

&НаСервере
Процедура 	ПроверитьДублиСтрокОбъектовДоступа(Отказ)

	
	ВремТаблица = Объект.ОбъектыДоступа.Выгрузить();
	ВремТаблица.Свернуть("ОбъектДоступа","");
	
	Отказ = ВремТаблица.Количество() <>  Объект.ОбъектыДоступа.Количество(); 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьПрофилиДоступаПользователей()
	
	ОтборПоСпискупользователей = Новый Структура("ДанныеИзРегистра",Ложь);
	мСтроки = СписокПользователей.НайтиСтроки(ОтборПоСпискупользователей);
	
	Если мСтроки.Количество() > 0 Тогда
		
		Для Каждого ИзмененнаяСтрока из мСтроки Цикл
			
			Набор = РегистрыСведений.CW_НастройкиПользователей.СоздатьНаборЗаписей();
			Набор.Отбор.Пользователь.Установить(ИзмененнаяСтрока.Пользователь);
			Набор.Прочитать();
			
			Если Набор.Количество() > 0 Тогда
				//Должна бытьтолько одна строка!
				
				СтрокаНабора = Набор[0];
				СтрокаНабора.ПрофильДоступаПользователя = Объект.Ссылка;
				
				Набор.Записать();
				
				ИзмененнаяСтрока.ДанныеИзРегистра = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтоНовый Тогда
		
		ПоказатьПредупреждение(,"Перед добавлением пользователя, элемент нужно записать!");
		
		Отказ = истина;
		
	КонецЕсли;
	
	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый 		= Параметры.Ключ.Пустая();
	ТолькоПросмотр 	= Объект.Предопределенный;
	
	Если Не ЭтоНовый Тогда
		ЗаполнитьСписокПользователей();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.СписокПользователей.Видимость 	= НЕ ЭтоНовый и Не Объект.Предопределенный;
	Элементы.ГруппаКомментарий.Видимость 	= НЕ Объект.Предопределенный;
	
	Элементы.ОбъектыДоступа.ТолькоПросмотр 	=  Объект.Предопределенный;
	Элементы.ЗначенияДоступа.ТолькоПросмотр =  Объект.Предопределенный;
	
КонецПроцедуры	
	
&наСервере
Процедура ЗаполнитьСписокПользователей()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиПользователей.Пользователь КАК Пользователь,
	|	ИСТИНА КАК ДанныеИзРегистра
	|ИЗ
	|	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	|ГДЕ
	|	CW_НастройкиПользователей.ПрофильДоступаПользователя = &ПрофильДоступаПользователя";
	
	Запрос.УстановитьПараметр("ПрофильДоступаПользователя", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокПользователей.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПользователейПередУдалениемНаСервере(Пользователь)
	
	Набор = РегистрыСведений.CW_НастройкиПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		//Должна быть только одна строка!
		//При удалени пользователя из группы записываетм предопределенное значение
		СтрокаНабора = Набор[0];
		СтрокаНабора.ПрофильДоступаПользователя = Справочники.CW_ПрофилиДоступа.ПоУмолчанию;
		Набор.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.СписокПользователей.ТекущиеДанные;
	
	Отказ = Истина;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, ТекущиеДанные.ПолучитьИдентификатор());
	ПоказатьВопрос(Оповещение,"Пользователю "+ТекущиеДанные.Пользователь+" будет назначен профиль доступа ""По умолчанию""", Режим, 0);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ИдентификатрСтроки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	СтрокаТаблицы = СписокПользователей.НайтиПоИдентификатору(ИдентификатрСтроки);
	
	СписокПользователейПередУдалениемНаСервере(СтрокаТаблицы.Пользователь); 
	
	СписокПользователей.Удалить(СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	
		ТекущиеДанныеОбъектыДоступа	 = Элементы.ОбъектыДоступа.ТекущиеДанные;
	ТекущиеДанныеЗначенияДоступа = Элементы.ЗначенияДоступа.ТекущиеДанные;
	
	ДопПараметры = новый Структура("ОбъектДоступа,ТипДоступа",ТекущиеДанныеОбъектыДоступа.ОбъектДоступа,ТекущиеДанныеОбъектыДоступа.ТипДоступа);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбора",ЭтаФорма, ДопПараметры);
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе,РежимВыбора", Истина, Истина, Истина);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияФормыВыбора(РезультатВыбора, ДопПараметры) Экспорт
	
	Если Не РезультатВыбора = Неопределено Тогда
		
		ОбработатьРезультатВыбораНаСервере(РезультатВыбора, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораНаСервере(РезультатВыбора, ДопПараметры)
	
	Для Каждого ЗначениеВыбора из РезультатВыбора Цикл
		
		Отбор = Новый Структура("ЗначениеДоступа", ЗначениеВыбора);
		мСтроки = Объект.ЗначенияДоступа.НайтиСтроки(Отбор);
		
		Если мСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.ЗначенияДоступа.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДопПараметры);
			
			НоваяСтрока.ЗначениеДоступа = ЗначениеВыбора;
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаЗначениеДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияДоступа.ТекущиеДанные;
	
	Если ТекущиеДанные.ОбъектДоступа = ПредопределенноеЗначение("Перечисление.CW_ОбъектыДоступа.Справочник_Контрагенты") Тогда
		ТекущиеДанные.ЗначениеДоступа =  ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	ИначеЕсли ТекущиеДанные.ОбъектДоступа = ПредопределенноеЗначение("Перечисление.CW_ОбъектыДоступа.Справочник_ВерсииБюджетов") Тогда
		ТекущиеДанные.ЗначениеДоступа =  ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.ПустаяСсылка");
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДоступаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ОбъектыДоступа.ТекущиеДанные;
	СтруктураПоиска = Новый Структура("ОбъектДоступа,ТипДоступа", ТекущиеДанные.ОбъектДоступа, ТекущиеДанные.ТипДоступа);
	
	УдалитьДанныеНаСервере(СтруктураПоиска)
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеНаСервере(СтруктураПоиска)
	
	мСтрокиУдалить = Объект.ЗначенияДоступа.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаМассива из  мСтрокиУдалить Цикл
		Объект.ЗначенияДоступа.Удалить(СтрокаМассива);	
	КонецЦикла;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры




#КонецОбласти
